#+title: Emacs experimental config

to run the config:

#+begin_src sh
emacs-sandbox.sh --no-package --no-refresh-packages --dir ~/.config/emacs-experiment
#+end_src

#+RESULTS:

#+begin_src scheme :tangle ~/.config/emacs-experiment/emacs-manifest.scm :noweb yes
(specifications->manifest (list
			   <<guix-packages>>)
#+end_src

to disable configuration in a subtree, refile the subtree to [[experimental]] or use ~org-toggle-archive-tag~ (bound to `C-c C-x a' by default).

*** fonts

- [[https://typeof.net/Iosevka/][Iosevka]]
- [[https://rubjo.github.io/victor-mono/][Victor Mono]]
- [[JuliaMono]]
- [[https://design.ubuntu.com/font/][Ubuntu font]] for variable pitch

#+begin_src emacs-lisp
(set-face-attribute 'default nil :family "Iosevka Slab" :weight 'normal :height 150)
;; (set-face-attribute 'fixed-pitch nil :family "JuliaMono" :weight 'normal)
(set-face-attribute 'fixed-pitch nil :family "Iosevka" :weight 'normal)
(set-face-attribute 'variable-pitch nil :family "Ubuntu" :weight 'light)
(setq-default line-spacing 0.15)
(add-hook 'org-mode-hook #'(lambda ()
			     (setq line-spacing 0.15)))
#+end_src

#+RESULTS:
| org-krita-mode | flyspell-mode | org-pdftools-setup-link | arche/org-mode-hook | valign-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (setq line-spacing 0.15)) |

#+begin_src scheme :noweb-ref guix-packages :noweb-sep ""

"font-iosevka"
"font-victor-mono"

#+end_src

*** epub

#+begin_src emacs-lisp
(use-package nov
  :config
  ;; tip: never use toc (t), use imenu instead!
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
  :hook
  (nov-mode . variable-pitch-mode))
#+end_src

#+RESULTS:
| variable-pitch-mode |

** telega
:LOGBOOK:
CLOCK: [2021-09-30 Thu 04:38]--[2021-09-30 Thu 04:41] =>  0:03
:END:

#+begin_src scheme :noweb-ref guix-packages :noweb-sep ""

"font-gnu-unifont"
"font-gnu-freefont"
"emacs-telega-server"
"emacs-telega-contrib"

#+end_src

~cl--plist-remove~ is a deprecated function and removed in telega source recently (#303).

#+begin_src emacs-lisp :tangle no
(defun cl--plist-remove (plist member)
  (cond
   ((null plist) nil)
   ((null member) plist)
   ((eq plist member) (cddr plist))
   (t `(,(car plist) ,(cadr plist) ,@(cl--plist-remove (cddr plist) member)))))
#+end_src

#+begin_src emacs-lisp
;;;###autoload
(defun arche/telega-mode-hook ()
  (setq line-spacing 0)
  (setq olivetti-body-width 100)
  (if (one-window-p) (olivetti-mode t)))

(use-package telega
  :after (olivetti)
  :init (fset 'cl--plist-remove 'map--plist-delete)
  :straight nil
  :config
  (setq telega-emoji-font-family "EmojiOne")
  (setq telega-emoji-use-images "EmojiOne") 
  ;; (setq telega-proxies
  ;; 	'((:server "127.0.0.1"
  ;; 		   :port 7890
  ;; 		   :enable t
  ;; 		   :type (:@type "proxyTypeHttp")
  ;; 		   )))
  (setq telega-proxies nil) 
  (add-hook 'telega-chat-mode-hook #'timeclock-query-out)
  (add-hook 'timeclock-in-hook #'(lambda () (telega-kill t)))
  (define-key dired-mode-map (kbd "H-s") #'telega-buffer-file-send)
  (add-hook 'telega-chat-mode-hook #'arche/telega-mode-hook)
  (add-hook 'telega-root-mode-hook #'arche/telega-mode-hook))
#+end_src

*** maxima

#+begin_src emacs-lisp
(use-package maxima)

;;;###autoload
(defun arche/maxima-inferior-mode-hook ()
  (meow-normal-mode t)
  (electric-pair-mode t))

(add-hook 'maxima-inferior-mode-hook #'arche/maxima-inferior-mode-hook)
(add-to-list 'org-babel-load-languages (cons 'maxima t))
#+end_src

#+RESULTS:
| arche/maxima-inferior-mode-hook |

** backup config

#+begin_src emacs-lisp
(setq backup-directory-alist (list (cons ""
					 (concat user-emacs-directory "backup/"))))
#+end_src

#+RESULTS:
: (( . ~/.config/emacs-experiment/backup/))

** map hard keys

#+begin_src emacs-lisp
(global-set-key (kbd "H-r") "`")
(global-set-key (kbd "H-t") "~")
(global-set-key (kbd "H-f") "\\")
#+end_src

#+RESULTS:
: \

** asy

#+begin_src emacs-lisp
(add-to-list 'org-babel-load-languages (cons 'asymptote t))
#+end_src

#+RESULTS:
: ((asymptote . t) (python . t) (scheme . t) (haskell . t) (C . t) (shell . t) (latex . t) (maxima . t) (emacs-lisp . t))

** xenops

#+begin_src emacs-lisp
(use-package xenops
  :straight (:host github :repo "dandavison/xenops" :branch "master"))

(add-to-list 'texmathp-environments "tikzcd")
#+end_src

#+RESULTS:
| tikzcd | equation | eqnarray | eqnarray* | math | displaymath | minipage | equation* | align | align* | gather | gather* | multline | multline* | flalign | flalign* | alignat | alignat* | xalignat | xalignat* | xxalignat | empheq | AmSequation | AmSequation* | AmSalign | AmSalign* | AmSgather | AmSgather* | AmSmultline | AmSmultline* | AmSflalign | AmSflalign* | AmSalignat | AmSalignat* | dmath | dmath* | dseries | dseries* | dgroup | dgroup* | darray | darray* | dsuspend |

